# Datos del Titanic

In [67]:
import seaborn as sns
import pandas as pd
import numpy as np

In [68]:
titanic = sns.load_dataset("titanic")

In [69]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [70]:
titanic.shape

(891, 15)

In [71]:
titanic['survived'] = pd.Categorical(titanic['survived']) #Se convierte en factor

In [72]:
titanic['pclass'] = pd.Categorical(titanic['pclass'])

In [73]:
titanic['sex'] = pd.Categorical(titanic['sex'])

In [74]:
titanic['deck'] = pd.Categorical(titanic['deck'])

## Tablas de contingencia de una variable

In [75]:
tab = pd.crosstab(index = titanic['survived'], columns = 'pasajeros')
tab

col_0     pasajeros
survived
0               549
1               342

In [76]:
type(tab)

pandas.core.frame.DataFrame

In [77]:
tab2 = pd.crosstab(index = titanic['pclass'], columns = 'pasajeros')
tab2

col_0   pasajeros
pclass
1             216
2             184
3             491

In [78]:
tab3 = pd.crosstab(index = titanic['sex'], columns = 'pasajeros')
tab3

col_0   pasajeros
sex
female        314
male          577

In [79]:
tab4 = pd.crosstab(index = titanic['deck'], columns = 'count')
tab4

col_0  count
deck
A         15
B         47
C         59
D         33
E         32
F         13
G          4

In [80]:
titanic.deck

0      NaN
1        C
2      NaN
3        C
4      NaN
5      NaN
6        E
7      NaN
8      NaN
9      NaN
10       G
11       C
12     NaN
13     NaN
14     NaN
15     NaN
16     NaN
17     NaN
18     NaN
19     NaN
20     NaN
21       D
22     NaN
23       A
24     NaN
25     NaN
26     NaN
27       C
28     NaN
29     NaN
      ...
861    NaN
862      D
863    NaN
864    NaN
865    NaN
866    NaN
867      A
868    NaN
869    NaN
870    NaN
871      D
872      B
873    NaN
874    NaN
875    NaN
876    NaN
877    NaN
878    NaN
879      C
880    NaN
881    NaN
882    NaN
883    NaN
884    NaN
885    NaN
886    NaN
887      B
888    NaN
889      C
890    NaN
Name: deck, Length: 891, dtype: category
Categories (7, object): [A, B, C, D, E, F, G]

In [81]:
tab4.sum()

col_0
count    203
dtype: int64

In [82]:
tab4.shape

(7, 1)

In [83]:
tab4.iloc[1:5]

col_0  count
deck
B         47
C         59
D         33
E         32

In [84]:
tab4/tab4.sum() #Frec. Relativas Globales

col_0     count
deck
A      0.073892
B      0.231527
C      0.290640
D      0.162562
E      0.157635
F      0.064039
G      0.019704

In [85]:
tab3/tab3.sum()

col_0   pasajeros
sex
female   0.352413
male     0.647587

In [86]:
tab/tab.sum()

col_0     pasajeros
survived
0          0.616162
1          0.383838

In [87]:
tab2/tab2.sum()

col_0   pasajeros
pclass
1        0.242424
2        0.206510
3        0.551066

## Tablas de contingencia de dos variables

In [88]:
survived_sex = pd.crosstab(index = titanic['survived'], 
                          columns = titanic['sex'])
survived_sex.index = ["Died", "Survived"] #Cambiamos los nombres a los indices
survived_sex

sex       female  male
Died          81   468
Survived     233   109

In [89]:
survived_class = pd.crosstab(index = titanic['survived'], 
                          columns = titanic['pclass'])
survived_class.index = ["Murió", "Sobrevivió"]
survived_class.columns = ["Primera", "Segunda", "Tercera"]
survived_class

            Primera  Segunda  Tercera
Murió            80       97      372
Sobrevivió      136       87      119

In [90]:
survived_class = pd.crosstab(index = titanic['survived'], 
                          columns = titanic['pclass'], 
                            margins = True)
survived_class.index = ["Murió", "Sobrevivió", "Total_Clase"]
survived_class.columns = ["Primera", "Segunda", "Tercera", "Total_superv"]
survived_class
# De las 891 personas que había, sobrevivieron 342, 
# De las 216 personas que había en primera clase, soobrevivieron 136, etc.

             Primera  Segunda  Tercera  Total_superv
Murió             80       97      372           549
Sobrevivió       136       87      119           342
Total_Clase      216      184      491           891

### Frecuencias relativas globales

In [91]:
survived_class/survived_class.loc["Total_Clase", "Total_superv"]

              Primera   Segunda   Tercera  Total_superv
Murió        0.089787  0.108866  0.417508      0.616162
Sobrevivió   0.152637  0.097643  0.133558      0.383838
Total_Clase  0.242424  0.206510  0.551066      1.000000

### Frecuencias relativas marginales

In [92]:
survived_class/survived_class.loc["Total_Clase"] #Por columnas, recordemos que 
# la instrucción loc sirve para localizar filas, no columnas.

             Primera   Segunda   Tercera  Total_superv
Murió        0.37037  0.527174  0.757637      0.616162
Sobrevivió   0.62963  0.472826  0.242363      0.383838
Total_Clase  1.00000  1.000000  1.000000      1.000000

In [93]:
survived_class.div(survived_class.loc['Total_Clase'], axis = 1)
#Otra forma de obtener la misma tabla

             Primera   Segunda   Tercera  Total_superv
Murió        0.37037  0.527174  0.757637      0.616162
Sobrevivió   0.62963  0.472826  0.242363      0.383838
Total_Clase  1.00000  1.000000  1.000000      1.000000

In [94]:
survived_class.T/survived_class["Total_superv"] #Con T obtengo la transpuesta
# De esta manera la obtenemos rapidamente

                 Murió  Sobrevivió  Total_Clase
Primera       0.145719    0.397661     0.242424
Segunda       0.176685    0.254386     0.206510
Tercera       0.677596    0.347953     0.551066
Total_superv  1.000000    1.000000     1.000000

In [95]:
survived_class.div(survived_class['Total_superv'], axis = 0)
#Con esta instrucción, obtenemos la misma tabla, pero en su forma original,
#no transpuesta

              Primera   Segunda   Tercera  Total_superv
Murió        0.145719  0.176685  0.677596           1.0
Sobrevivió   0.397661  0.254386  0.347953           1.0
Total_Clase  0.242424  0.206510  0.551066           1.0

## Tablas multidimensionales

In [96]:
surv_sex_class1 = pd.crosstab(titanic["survived"],
                            columns = [titanic["sex"], titanic["pclass"]],
                            margins = True)
surv_sex_class1

sex      female          male            All
pclass        1   2    3    1    2    3
survived
0             3   6   72   77   91  300  549
1            91  70   72   45   17   47  342
All          94  76  144  122  108  347  891

In [97]:
surv_sex_class2 = pd.crosstab(titanic["survived"],
                            columns = [titanic["sex"], titanic["pclass"]],
                            margins = True)
surv_sex_class2.index = ["Murió", "Sobrevivió", "Total"]
surv_sex_class2.columns = pd.MultiIndex.from_tuples([('Mujer', 'Primera'), ('Mujer', 'Segunda'),
                                                  ('Mujer', 'Tercera'), ('Hombre', 'Primera'),
                                                  ('Hombre', 'Segunda'), ('Hombre', 'Tercera'),
                                                  ('', 'Total')],
                                                 )
surv_sex_class2

             Mujer                  Hombre
           Primera Segunda Tercera Primera Segunda Tercera Total
Murió            3       6      72      77      91     300   549
Sobrevivió      91      70      72      45      17      47   342
Total           94      76     144     122     108     347   891

In [98]:
surv_sex_class1['female']

pclass     1   2    3
survived
0          3   6   72
1         91  70   72
All       94  76  144

In [99]:
surv_sex_class2["Mujer"]

            Primera  Segunda  Tercera
Murió             3        6       72
Sobrevivió       91       70       72
Total            94       76      144

In [100]:
surv_sex_class1['female'][1]

survived
0       3
1      91
All    94
Name: 1, dtype: int64

In [101]:
surv_sex_class2["Mujer"]["Primera"] #Primero por sexo, luego por clase

Murió          3
Sobrevivió    91
Total         94
Name: Primera, dtype: int64

In [102]:
surv_sex_class1/surv_sex_class1.loc["All"]

sex         female                     male                           All
pclass           1         2    3         1         2         3
survived
0         0.031915  0.078947  0.5  0.631148  0.842593  0.864553  0.616162
1         0.968085  0.921053  0.5  0.368852  0.157407  0.135447  0.383838
All       1.000000  1.000000  1.0  1.000000  1.000000  1.000000  1.000000

In [103]:
surv_sex_class2/surv_sex_class2.loc["Total"] #Marginal por columnas

               Mujer                      Hombre
             Primera   Segunda Tercera   Primera   Segunda   Tercera     Total
Murió       0.031915  0.078947     0.5  0.631148  0.842593  0.864553  0.616162
Sobrevivió  0.968085  0.921053     0.5  0.368852  0.157407  0.135447  0.383838
Total       1.000000  1.000000     1.0  1.000000  1.000000  1.000000  1.000000

In [104]:
surv_sex_class1.div(surv_sex_class1['All'], axis = 0)

sex         female                          male                      All
pclass           1         2         3         1         2         3
survived
0         0.005464  0.010929  0.131148  0.140255  0.165756  0.546448  1.0
1         0.266082  0.204678  0.210526  0.131579  0.049708  0.137427  1.0
All       0.105499  0.085297  0.161616  0.136925  0.121212  0.389450  1.0

In [105]:
surv_sex_class2.div(surv_sex_class2['', 'Total'], axis = 0)

               Mujer                        Hombre
             Primera   Segunda   Tercera   Primera   Segunda   Tercera Total
Murió       0.005464  0.010929  0.131148  0.140255  0.165756  0.546448   1.0
Sobrevivió  0.266082  0.204678  0.210526  0.131579  0.049708  0.137427   1.0
Total       0.105499  0.085297  0.161616  0.136925  0.121212  0.389450   1.0